{
  "diagrams": [
    {
      "filename": "1.png",
      "type": "BPMN - Swimlane диаграмма",
      "description": "Процесс управления технологическим стеком в организации. Диаграмма представляет собой BPMN Swimlane схему с одной дорожкой для технологического отдела. Процесс включает следующие этапы: принятие новой технологии в стек компании, активное использование принятой технологии в проектах, получение ответа и обратной связи от технологии или инженерного отдела относительно эффективности использования, принятие решения о завершении использования технологии при необходимости.",
      "roles": [
        {"name": "Технологический отдел", "description": "Отвечает за принятие и управление технологиями"}
      ],
      "sequence": [
        "1. Начало: Принятие технологии",
        "2. Действие: Использование технологии в проектах",
        "3. Действие: Ответ от технологии или инженерного отдела, завершение использования",
        "4. Конец процесса"
      ],
      "plantuml": "@startuml\n|Технологический отдел|\nstart\n:Принятие технологии;\n:Использование технологии в проектах;\n:Ответ от технологии или инженерного отдела;\nstop\n@enduml"
    },
    {
      "filename": "13.png",
      "type": "BPMN - Сложная блок-схема с подпроцессами",
      "description": "Комплексный процесс управления проектами развития в организации. Диаграмма представляет собой сложную BPMN схему с множественными подпроцессами и параллельными потоками выполнения. Основные этапы процесса: формирование и актуализация бэклога поставщика с участием владельца продукта, приоритизация проектов руководителем портфеля проектов на основе бизнес-ценности и ресурсов, формирование детального списка работ по каждому проекту, актуализация и управление списком работ в процессе выполнения, мониторинг прогресса выполнения работ ответственными за направления, внедрение координирования между различными проектами и командами. Процесс включает множество точек синхронизации и согласования между различными ролями.",
      "roles": [
        {"name": "Владелец продукта", "description": "Управляет бэклогом"},
        {"name": "Руководитель портфеля проектов", "description": "Приоритизирует проекты"},
        {"name": "Ответственный за направление", "description": "Контролирует выполнение"},
        {"name": "Руководитель портфеля проектов", "description": "Мониторит и внедряет координирование"}
      ],
      "sequence": [
        "1. Начало: Управление проектами развития",
        "2. Подпроцесс: Формирование бэклога поставщика",
        "3. Подпроцесс: Приоритизация проектов",
        "4. Подпроцесс: Формирование и актуализация управление списком работ",
        "5. Параллельные процессы мониторинга",
        "6. Конец процесса"
      ],
      "plantuml": "@startuml\n|Владелец продукта|\nstart\n:Формирование бэклога;\n|Руководитель портфеля|\n:Приоритизация проектов;\nfork\n  :Согласованный список проектов;\nfork again\n  :Список приоритетных проектов;\nend fork\n:Мониторинг и внедрение;\nstop\n@enduml"
    },
    {
      "filename": "16.png",
      "type": "Sequence Diagram - Диаграмма последовательности",
      "description": "Процесс аутентификации пользователя с использованием токенов доступа. Диаграмма последовательности (Sequence Diagram) демонстрирует взаимодействие между тремя участниками системы: клиентским приложением, сервером аутентификации и сервером ресурсов. Последовательность действий: клиент инициирует процесс аутентификации отправкой запроса с учетными данными пользователя на сервер аутентификации, сервер аутентификации выполняет проверку предоставленных учетных данных в базе данных пользователей, при успешной проверке сервер генерирует и выдает токен доступа клиенту, клиент использует полученный токен для запроса защищенного ресурса на сервере ресурсов, сервер ресурсов проверяет валидность и права доступа токена, при успешной проверке токена сервер ресурсов возвращает запрошенный защищенный ресурс клиенту.",
      "roles": [
        {"name": "Клиент", "description": "Инициирует запрос"},
        {"name": "Сервер аутентификации", "description": "Проверяет учетные данные"},
        {"name": "Сервер ресурсов", "description": "Предоставляет защищенные ресурсы"}
      ],
      "sequence": [
        "1. Клиент отправляет запрос с учетными данными",
        "2. Сервер аутентификации проверяет данные",
        "3. Сервер выдает токен доступа",
        "4. Клиент запрашивает ресурс с токеном",
        "5. Сервер ресурсов проверяет токен",
        "6. Сервер возвращает защищенный ресурс"
      ],
      "plantuml": "@startuml\nactor Клиент\nparticipant \"Сервер\\nаутентификации\" as Auth\nparticipant \"Сервер\\nресурсов\" as Resource\n\nКлиент -> Auth: Запрос с учетными данными\nAuth -> Auth: Проверка данных\nAuth -> Клиент: Токен доступа\nКлиент -> Resource: Запрос ресурса с токеном\nResource -> Resource: Проверка токена\nResource -> Клиент: Защищенный ресурс\n@enduml"
    },
    {
      "filename": "23.png",
      "type": "BPMN - Организационная структура с ролями",
      "description": "Организационная структура и процессы команды разработки Building Information Modeling (BIM). BPMN диаграмма с распределением ролей и ответственности демонстрирует три основных процесса: предоставление BIM/BD (Building Information Modeling / Building Data) с участием ответственного за выработку BIM/BD, клиента и Construction Stream Lead, контроль статусов открытых BIM/BD задач с мониторингом Project Manager и TAM (Technical Account Manager), установка обновлений продуктов включающая подготовку к тестированию под контролем TAM, проведение тестирования ответственным за QA, установку обновлений ответственным за DevOps, контроль со стороны ответственного за ПИР (проектно-изыскательские работы). Диаграмма показывает параллельное выполнение задач различными ролями и точки синхронизации между процессами.",
      "roles": [
        {"name": "Ответственный за выработку BIM/BD", "description": "Главный координатор"},
        {"name": "Клиент", "description": "Заказчик проекта"},
        {"name": "Construction Stream Lead", "description": "Руководитель потока строительства"},
        {"name": "Project Manager", "description": "Менеджер проекта"},
        {"name": "TAM", "description": "Технический менеджер аккаунта"},
        {"name": "Ответственный за проведение тестирования", "description": "QA специалист"},
        {"name": "Ответственный за ПИР", "description": "Проектно-изыскательские работы"},
        {"name": "Ответственный за установку обновлений", "description": "DevOps специалист"}
      ],
      "sequence": [
        "1. Предоставление BIM/BD",
        "2. Контроль статусов открытых BIM/BD",
        "3. Установка обновлений продуктов",
        "3.1. Подготовка к тестированию",
        "3.2. Установка обновлений",
        "4. Параллельные процессы контроля качества"
      ],
      "plantuml": "@startuml\n|Ответственный за BIM/BD|\nstart\n:Предоставление BIM/BD;\n|Project Manager|\n:Контроль статусов;\nfork\n  |TAM|\n  :Подготовка к тестированию;\n  :Установка обновлений;\nfork again\n  |Ответственный за ПИР|\n  :Контроль качества;\nend fork\nstop\n@enduml"
    },
    {
      "filename": "49.png",
      "type": "BPMN - Swimlane с тремя участниками",
      "description": "Комплексный процесс обработки обращений клиентов в интегрированной системе управления взаимоотношениями. BPMN Swimlane диаграмма с тремя дорожками представляет взаимодействие систем: ПК ВЭД (Личный Кабинет Внешнеэкономической Деятельности) - интерфейс пользователя для работы с обращениями, ERM (Enterprise Resource Management) - система управления ресурсами предприятия для обработки и маршрутизации, CRM (Customer Relationship Management) - система управления взаимоотношениями с клиентами для регистрации и хранения обращений. Полный цикл процесса: пользователь открывает личный кабинет и просматривает список своих обращений, система выполняет сбор данных о подключенных точках снабжения согласно известной иерархии клиента, происходит сбор всех обращений из базы данных по лицевым счетам клиента, система запрашивает получение актуальных данных по собранному массиву обращений из CRM через API, ERM выполняет обработку и фильтрацию входного потока данных согласно бизнес-правилам, CRM регистрирует новое обращение в системе при необходимости, система отправляет уведомление AMQP (Advanced Message Queuing Protocol) по факту взятия обращения на обработку ответственным специалистом, CRM формирует и возвращает актуальный список обращений по запрошенному списку идентификаторов, ПК ВЭД обновляет кэшированные данные по обращениям для ускорения последующих запросов, система отображает пользователю полный список обращений с актуальной информацией о статусах, ответственных и сроках.",
      "roles": [
        {"name": "ПК ВЭД", "description": "Личный кабинет пользователя - инициирует обращения"},
        {"name": "ERM", "description": "Enterprise Resource Management - обрабатывает и фильтрует обращения"},
        {"name": "CRM", "description": "Customer Relationship Management - регистрирует и управляет обращениями"}
      ],
      "sequence": [
        "1. ПК ВЭД: Открытие ЛК пользователем списка обращений",
        "2. ПК ВЭД: Сбор подключенного ПС согласно известной иерархии",
        "3. ПК ВЭД: Сбор обращений из БД по ЛС",
        "4. ПК ВЭД: Получение данных по собранному массиву обращений из CRM",
        "5. ERM: Обработка и фильтрация входного потока",
        "6. CRM: Регистрация обращения",
        "7. CRM: Отправка AMQP по факту взятия обращения на обработку",
        "8. CRM: Получение актуального списка обращений по списку",
        "9. ПК ВЭД: Обновление данных по обращениям в кэше",
        "10. ПК ВЭД: Отображение списка обращений с актуальной информацией"
      ],
      "plantuml": "@startuml\n|ПК ВЭД|\nstart\n:Открытие ЛК пользователем;\n:Сбор подключенного ПС;\n:Сбор обращений из БД;\n:Получение данных по массиву обращений;\n|ERM|\n:Обработка и фильтрация;\n|CRM|\n:Регистрация обращения;\n:Отправка AMQP;\n:Получение списка обращений;\n|ПК ВЭД|\n:Обновление данных в кэше;\n:Отображение списка обращений;\nstop\n@enduml"
    }
  ]
}
